In [1]:
import pandas as pd

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost':22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost':2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost':5.00}],
                 index=['Store 1', 'Store 1', 'Store 2'])
df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

In [2]:
df['Date'] = ['December 1', 'January 1', 'mid-Day']

In [3]:
df

         Cost Item Purchased   Name        Date
Store 1  22.5         Sponge  Chris  December 1
Store 1   2.5   Kitty Litter  Kevyn   January 1
Store 2   5.0          Spoon  Filip     mid-Day

In [4]:
df['Delivered'] = 'Yes'
df

         Cost Item Purchased   Name        Date Delivered
Store 1  22.5         Sponge  Chris  December 1       Yes
Store 1   2.5   Kitty Litter  Kevyn   January 1       Yes
Store 2   5.0          Spoon  Filip     mid-Day       Yes

In [5]:
df['Delivered'] = True
df

         Cost Item Purchased   Name        Date  Delivered
Store 1  22.5         Sponge  Chris  December 1       True
Store 1   2.5   Kitty Litter  Kevyn   January 1       True
Store 2   5.0          Spoon  Filip     mid-Day       True

In [6]:
df['Feedback'] = ['Positive', None, 'Negative']
df

         Cost Item Purchased   Name        Date  Delivered  Feedback
Store 1  22.5         Sponge  Chris  December 1       True  Positive
Store 1   2.5   Kitty Litter  Kevyn   January 1       True      None
Store 2   5.0          Spoon  Filip     mid-Day       True  Negative

In [8]:
adf = df.reset_index()
adf['Date'] = pd.Series({0: 'December 1', 2:'mid-Day'})
adf

     index  Cost Item Purchased   Name        Date  Delivered  Feedback
0  Store 1  22.5         Sponge  Chris  December 1       True  Positive
1  Store 1   2.5   Kitty Litter  Kevyn         NaN       True      None
2  Store 2   5.0          Spoon  Filip     mid-Day       True  Negative

In [11]:
staff_df = pd.DataFrame([{'Name':'Kelly', 'Role':'Director of HR'},
                        {'Name':'Sally', 'Role':'Course liasion'},
                        {'Name':'James', 'Role':'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name':'James', 'Student':'Business'},
                        {'Name':'Mike', 'Student':'Law'},
                        {'Name':'Sally', 'Student':'Engineering'}])
student_df = student_df.set_index('Name')
print(staff_df)
print()
print(student_df)

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

           Student
Name
James     Business
Mike           Law
Sally  Engineering

In [12]:
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role      Student
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [14]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role      Student
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [15]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role      Student
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [16]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role      Student
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

In [24]:
# staff_df = staff_df.reset_index()
staff_df = pd.DataFrame([{'Name':'Kelly', 'Role':'Director of HR'},
                        {'Name':'Sally', 'Role':'Course liasion'},
                        {'Name':'James', 'Role':'Grader'}])
#student_df = student_df.reset_index()
student_df = pd.DataFrame([{'Name':'James', 'Student':'Business'},
                        {'Name':'Mike', 'Student':'Law'},
                        {'Name':'Sally', 'Student':'Engineering'}])
print(staff_df)
print()
print(student_df)

    Name            Role
0  Kelly  Director of HR
1  Sally  Course liasion
2  James          Grader

    Name      Student
0  James     Business
1   Mike          Law
2  Sally  Engineering

In [27]:
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role      Student
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business

In [28]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])

In [31]:
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

          Location_x   Name            Role            Location_y       School
0       State Street  Kelly  Director of HR                   NaN          NaN
1  Washington Avenue  Sally  Course liasion   512 Wilson Crescent  Engineering
2  Washington Avenue  James          Grader  1024 Billiard Avenue     Business

In [32]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])

In [33]:
staff_df

  First Name   Last Name            Role
0      Kelly  Desjardins  Director of HR
1      Sally      Brooks  Course liasion
2      James       Wilde          Grader

In [34]:
student_df

  First Name Last Name       School
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering

In [35]:
pd.merge(staff_df, student_df, how='inner', left_on=['First Name', 'Last Name'], right_on=['First Name', 'Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering